//додавання. до числового можна додавати рядкове
const a = 1;
const b = a + 2;

console.log(b);

//віднімання. але від числового не можна віднімати рядкове
const c = 4;
const d = c - 2;

console.log(d);

//віднімання. від числа можна відняти число якщо воно навіть записане як рядковийй символ в лапках
const e = 4;
const g = 1 - "10";

console.log(g);

//множення. рядок з числом перетвориться на рядок
const k = 4;
const h = k * 4;

console.log(h);

//степінь. також працює з числами в лапках. не працює з текстом
const l = 4;
const j = l ** 2;

console.log(j);

//остача. вказує остачу при діленні що залишається від цілого числа неділеним
const m = 4;
const f = 21 % m;

console.log(f);

//інкремент. збільшує число на 1
let n = 21 % 7;

n = ++n;

console.log(n);

//декремент. зменшує число на 1
let p = 21 % 7;

p = --p;

console.log(p);

//арифметичний оператор присвоєння. можна виконувати з будь якими операторами
let q = 21;
q += 4;

console.log(q);